{"inkVersion":21,"root":[[{"->":"Start"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"Start":[["ev","str","^hello","/str",{"f()":"setTitle"},"pop","/ev","\n","ev",{"VAR?":"name"},"/ev",{"VAR=":"title","re":true},"ev","str","^Snowfall","/str",{"x()":"PlayBGM","exArgs":1},"out","/ev","\n","^You are playing as a young college student in your early twenties who is deeply entrenched in the digital world. You are intelligent and ambitious, you were excelling in your career thanks to your proficiency with technology. However, beneath the facade of success lies a growing sense of unease and dissatisfaction.","\n","^Your screen addiction, fueled by anxiety and depression, has taken a toll on your mental and physical well-being, leaving you feeling more drained and anxious. You have been unable to perform everyday tasks and struggle to even show up for work, but you want to change and make better habits.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ ",{"->":"Introduction"},"\n",{"#f":5}]}],{"#f":1}],"Introduction":[["ev","str","ev",{"VAR?":"name"},"out","/ev","^'s Room, Thursday","/str",{"f()":"setTitle"},"pop","/ev","\n","ev","str","^MessyBedroom1","/str",{"x()":"ShowBackground","exArgs":1},"out","/ev","\n","ev",50,{"f()":"updateHappiness"},"out","/ev","\n","ev","str","^PhonePing","/str",{"x()":"PlaySFX","exArgs":1},"out","/ev","\n","^You reach for your phone. While scrolling through notifications, you see an unexpected message from your old roommate, Sam.","\n","ev","str","^PhoneScreen1","/str","str","^mid","/str",{"x()":"ShowCharacter","exArgs":2},"out","/ev","\n","^\"Hey ","ev",{"VAR?":"name"},"out","/ev","^, it’s been a while since we caught up! Do you want to grab coffee this weekend?\"","\n","^How would you like to begin this journey?","\n","ev","str","^Reply to your friend, accepting the invitation to the coffee date","/str","/ev",{"*":".^.c-0","flg":20},["ev",{"^->":"Introduction.0.62.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^Crawl back into bed and doom scroll ",{"->":"$r","var":true},null]}],{"c-0":["^ ","\n",{"->":"ReplyToFriend"},{"#f":5}],"c-1":["ev",{"^->":"Introduction.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.62.s"},[{"#n":"$r2"}],"\n",{"->":"DoomScroll"},{"#f":5}]}],{"#f":1}],"ReplyToFriend":[["^You text back a response that marks the beginning of a transformative journey:","\n","ev","str","^PhoneScreen1","/str",{"x()":"HideCharacter","exArgs":1},"out","/ev","\n","ev","str","^PhoneScreen2","/str","str","^mid","/str",{"x()":"ShowCharacter","exArgs":2},"out","/ev","\n","ev","str","^PhoneTexting","/str",{"x()":"PlaySFX","exArgs":1},"out","/ev","\n","^“Hey! It’s been too long. Coffee sounds great! I’ll see you this weekend!”","\n","ev","str","^PhoneScreen2","/str",{"x()":"HideCharacter","exArgs":1},"out","/ev","\n","^With a deep breath, you close your eyes and take a deep breath. You gently place your phone facedown on the table, its screen now devoid of distractions. In that simple gesture lies a quiet act of defiance – a symbolic declaration of intent to reclaim control over your own life.","\n","ev","str","^Continue to next day","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ ",{"->":"Part1"},"\n",{"#f":5}]}],{"#f":1}],"DoomScroll":[["ev","str","^PhoneScreen4","/str","str","^mid","/str",{"x()":"ShowCharacter","exArgs":2},"out","/ev","\n","ev","str","^Desolate","/str",{"x()":"PlayBGM","exArgs":1},"out","/ev","\n","^You begin scrolling through your social media feeds, mindlessly consuming post after post. At first, the endless stream of content provides a sense of distraction, but as time goes on, a growing sense of unease creeps in.","\n","^With each swipe and tap, you feel a disconnect from the real world. The problems that once seemed so pressing now fade into insignificance, replaced by a superficial world of curated images and filtered updates.","\n","ev",-20,{"f()":"updateHappiness"},"out","/ev","\n","^Hours pass by unnoticed as you lose yourself in the digital abyss. Your phone becomes an extension of yourself, a constant companion that isolates you from the outside world.","\n","ev","str","ev",{"VAR?":"name"},"out","/ev","^'s Room, Thursday Night","/str",{"f()":"setTitle"},"pop","/ev","\n","^As the night wears on, you realize that you have ignored your friend's messages. A wave of guilt washes over you, but you are unable to pull yourself away from the screen. The allure of social media has become too strong.","\n","ev",-20,{"f()":"updateHappiness"},"out","/ev","\n","ev","str","ev",{"VAR?":"name"},"out","/ev","^'s Room, Friday","/str",{"f()":"setTitle"},"pop","/ev","\n","^Finally, as the first rays of dawn break, you set aside your phone. But the sense of emptiness and isolation lingers. You have spent the entire night doomscrolling, neglecting your responsibilities and relationships.","\n","^In the harsh light of day, you are forced to confront the consequences of your actions. You have allowed social media to consume your life, and in doing so, you have lost sight of what truly matters.","\n","ev",-20,{"f()":"updateHappiness"},"out","/ev","\n","^Overwhelmed by regret and self-loathing, you sink into a deep depression. The outside world becomes a distant memory as you retreat further into your digital prison. You have sacrificed your well-being for the fleeting dopamine rush that social media provides, and now you are paying the price.","\n","ev","str","^PhoneScreen4","/str",{"x()":"HideCharacter","exArgs":1},"out","/ev","\n","ev","str","^End Game","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n","ev",{"x()":"RestartGame"},"out","/ev","\n","end",{"#f":5}]}],{"#f":1}],"Part1":[["ev","str","ev",{"VAR?":"name"},"out","/ev","^'s Room, Friday","/str",{"f()":"setTitle"},"pop","/ev","\n","ev","str","^MessyBedroom1","/str",{"x()":"ShowBackground","exArgs":1},"out","/ev","\n","ev","str","^PhoneScreen3","/str","str","^mid","/str",{"x()":"ShowCharacter","exArgs":2},"out","/ev","\n","^You begin to navigate through the labyrinth of settings until you find what you’re looking for: screen time limits","\n","^With a few taps, you set strict boundaries, vowing to reclaim control over your digital habits.","\n","ev","str","^PhoneScreen3","/str",{"x()":"HideCharacter","exArgs":1},"out","/ev","\n","^You put your phone away, out of sight and out of mind. In its absence, you feel a sense of unease but also a feeling of a weight being lifted from your shoulders.","\n","^How would you like to spend your time?","\n","ev","str","^Go work on a hobby","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Scroll through social media","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ ",{"->":"WorkOnHobby"},"\n",{"#f":5}],"c-1":["^ ",{"->":"ScrollSocialMedia"},"\n",{"#f":5}]}],{"#f":1}],"WorkOnHobby":["ev","str","^Guitar","/str","str","^right","/str",{"x()":"ShowCharacter","exArgs":2},"out","/ev","\n","ev","str","^GuitarSFX","/str",{"x()":"PlaySFX","exArgs":1},"out","/ev","\n","^You decide to spend some time listening and playing some music, which you have not done in while. You dust off the old guitar that’s been sitting in the corner of your room for months.","\n","^Lost in the creative process, you lose track of time and hours pass by in a blur as you experiment with different melodies, feeling a renewed sense of purpose.","\n","ev",20,{"f()":"updateHappiness"},"out","/ev","\n","^You realize that engaging in a hobby you are passionate about has not only provided a much-needed break from screens but has also allowed you to reconnect with a part of yourself you had neglected. You vow to make time for hobbies more often, recognizing the importance of fostering passions.","\n","ev","str","^Guitar","/str",{"x()":"HideCharacter","exArgs":1},"out","/ev","\n",{"->":"Part2A"},{"#f":1}],"ScrollSocialMedia":["ev","str","^PhoneScreen4","/str","str","^mid","/str",{"x()":"ShowCharacter","exArgs":2},"out","/ev","\n","^After putting your phone down, you feel uneasy and crave the familiarity of scrolling through social media. Ignoring the reminder of your screen time limits, you reach for your phone.","\n","^With each swipe and tap, you are feeling more and more detached from the world around you, losing yourself in the endless scroll of curated images and updates. The minutes turn into hours, your mind numbed by the overwhelming amount of information and content.","\n","ev",-20,{"f()":"updateHappiness"},"out","/ev","\n","^You realize with a sinking feel that you’ve undone all the progress you made in reclaiming control over your digital habits. As you finally set aside your phone and drift off to sleep, a sense of unease and anxiety lingers. Deep down, you know that true fulfillment lies not in the artificial validation of the digital world, but in the meaningful connections and experiences in the real world.","\n","ev","str","^PhoneScreen4","/str",{"x()":"HideCharacter","exArgs":1},"out","/ev","\n",{"->":"Part2B"},{"#f":1}],"Part2A":["ev","str","ev",{"VAR?":"name"},"out","/ev","^'s Room, Saturday","/str",{"f()":"setTitle"},"pop","/ev","\n","^The next morning arrives and as you slowly open your eyes, you’re greeted by a sense of calmness in the air, a stark contrast to the usual grogginess that accompanies the start of a new day.","\n","^As you stretch and rise from bed, feeling surprisingly well-rested and energized you glance at your phone which was left untouched from the previous day. Your phone begins to buzz with a familiar notification. You check the notification, seeing a message from the friend you made plans with a few days ago.","\n","ev","str","^PhonePing","/str",{"x()":"PlaySFX","exArgs":1},"out","/ev","\n","^“Hey ","ev",{"VAR?":"name"},"out","/ev","^! Just wanted to check in and confirm our coffee date for today. Can’t wait to catch up with you!”","\n",{"->":"RespondToCheckIn"},{"#f":1}],"Part2B":["ev","str","ev",{"VAR?":"name"},"out","/ev","^'s Room, Saturday","/str",{"f()":"setTitle"},"pop","/ev","\n","^The next morning arrives and as you slowly open your eyes, you’re greeted by a sense of heaviness in the air. Rubbing your eyes, you groggily reach for your phone.","\n","^Your phone begins to buzz with a familiar notification. You check the notification, seeing a message from the friend you made plans with a few days ago.","\n","ev","str","^PhonePing","/str",{"x()":"PlaySFX","exArgs":1},"out","/ev","\n","^“Hey ","ev",{"VAR?":"name"},"out","/ev","^! Just wanted to check in and confirm our coffee date for today. Can’t wait to catch up with you!”","\n",{"->":"RespondToCheckIn"},{"#f":1}],"RespondToCheckIn":[["^How would you like to respond?","\n",["ev",{"^->":"RespondToCheckIn.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^\"Hey Sam! I’m really looking forward to our coffee date, can’t wait to catch up with you too!\" ",{"->":"$r","var":true},null]}],["ev",{"^->":"RespondToCheckIn.0.3.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^\"Sorry, something came up last minute. Maybe next time!\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"RespondToCheckIn.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n",{"->":"YesToPlans"},{"#f":5}],"c-1":["ev",{"^->":"RespondToCheckIn.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.3.s"},[{"#n":"$r2"}],"\n",{"->":"NoToPlans"},{"#f":5}]}],{"#f":1}],"YesToPlans":["ev",20,{"f()":"updateHappiness"},"out","/ev","\n","ev","str","^PhoneTexting","/str",{"x()":"PlaySFX","exArgs":1},"out","/ev","\n","ev","str","^PhoneScreen5A","/str","str","^mid","/str",{"x()":"ShowCharacter","exArgs":2},"out","/ev","\n","^You quickly type out a response, expressing your enthusiasm to see them. A smile spreads across your face as you are excited to reconnect with your old roommate, Sam. It’s been a while since you made plans with friends and despite constantly checking online forums, you have been feeling isolated and alone.","\n","^As you get ready for the day ahead, you can’t help but notice the positive impact that engaging in your hobby and reconnecting with a friend has had on your mood and outlook.","\n","ev","str","^PhoneScreen5A","/str",{"x()":"HideCharacter","exArgs":1},"out","/ev","\n",{"->":"Plans"},{"#f":1}],"NoToPlans":[["ev",-20,{"f()":"updateHappiness"},"out","/ev","\n","ev","str","^PhoneTexting","/str",{"x()":"PlaySFX","exArgs":1},"out","/ev","\n","ev","str","^PhoneScreen5B","/str","str","^mid","/str",{"x()":"ShowCharacter","exArgs":2},"out","/ev","\n","^As you stare at the message of your friend, a wave of conflicting emotions washes over you. While part of you misses human connection, another part feels weighed down by a sense of guilt and unease.","\n","^You hesitantly respond that now is not the right time as you feel that you’re not in the right headspace to engage in social interaction.","\n","^As you hit send, you can’t help but feel like you’ve let your friend down and missed out on an opportunity for connection. The weight of your decision hangs heavy on your shoulders.","\n","^You still have time to decide, are you sure you want to say no?","\n","ev","str","^PhoneScreen5B","/str",{"x()":"HideCharacter","exArgs":1},"out","/ev","\n",["ev",{"^->":"NoToPlans.0.41.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^Stick with your choice ",{"->":"$r","var":true},null]}],["ev",{"^->":"NoToPlans.0.42.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^Text Sam you can make it for coffee  ",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"NoToPlans.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.41.s"},[{"#n":"$r2"}],"\n",{"->":"NoPlans"},{"#f":5}],"c-1":["ev",{"^->":"NoToPlans.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.42.s"},[{"#n":"$r2"}],"\n",{"->":"TextSam"},{"#f":5}]}],{"#f":1}],"NoPlans":["ev",-20,{"f()":"updateHappiness"},"out","/ev","\n","^As the hours pass by, you can’t shake the feeling of loneliness that settles over you. Despite your best efforts to distract yourself with more technology, the nagging sense of guilt still lingers.","\n","^You find yourself retreating to the solitude of your bed earlier than usual.","\n","^With a heavy sigh, you slip beneath the covers, staring up at the ceiling in the dim light of your room. As the night stretches on and the darkness deepens, you find yourself trapped in a cycle of regret and sadness.","\n",{"->":"BadEnding"},{"#f":1}],"TextSam":["ev",20,{"f()":"updateHappiness"},"out","/ev","\n","^You find yourself regretting your decision as you long for connection. With a deep breath, you reach for your phone and begin to type out a message asking if it was still possible to meet for coffee.","\n","^A sense of relief washes over you as your friend quickly responds with enthusiasm, eager to resume plans.","\n",{"->":"Plans"},{"#f":1}],"Plans":["^As the time for your coffee date with Sam approaches, you find yourself feeling nervous. It’s been too long since you’ve made plans with a friend, the thought of stepping out of your comfort zone fills you with anxiety.","\n","ev","str","^Outside","/str",{"f()":"setTitle"},"pop","/ev","\n","ev","str","^Outdoors","/str",{"x()":"ShowBackground","exArgs":1},"out","/ev","\n","ev",20,{"f()":"updateHappiness"},"out","/ev","\n","^With a deep breath, you push aside the doubts and worries, stepping outside into the crisp spring air. You’re greeted by the sight of blossoming flowers and the sweet melody of birds above you. The world seems to come alive around you as you embrace the present moment, marveling at the beauty of the world around you.","\n","^As you approach the cafe, you can’t help but feel grateful for the simple act of stepping outside and walking towards a brighter, more fulfilling future. You take a moment to appreciate the warmth of the sun and beauty of nature surrounding you, you feel at peace and more alive than you have in a long time.","\n","ev","str","^Cafe","/str",{"f()":"setTitle"},"pop","/ev","\n","ev","str","^Cafe","/str",{"x()":"ShowBackground","exArgs":1},"out","/ev","\n","ev",20,{"f()":"updateHappiness"},"out","/ev","\n","^Arriving at the cafe, you spot your friend Sam waiting for you at a table on the outdoor terrace. As you sip your coffee and share stories of your lives, you’re reminded of the power of human connection and the importance of surrounding yourself with supportive friends. You decide to open up about your struggles with mental health and screen addiction with Sam.","\n","^To your surprise, Sam listens attentively, their expression one of empathy and compassion. As you speak, you feel a weight lifting from your shoulders and a sense of gratitude for the connection you share. This was a reminder of how true change is possible, especially when you have a supportive community to lean on.","\n",{"->":"GoodEnding"},{"#f":1}],"GoodEnding":[["ev","str","^ChillLofi","/str",{"x()":"PlayBGM","exArgs":1},"out","/ev","\n","^As the day comes to a close, you find yourself sitting quietly, reflecting on the events of the day.","\n","^The coffee date with Sam served as a turning point—a reminder of the importance of human connection and the support of friends on your journey toward self-improvement. Though the road ahead may be long and challenging, you're filled with a renewed determination to continue making positive changes in your life.","\n","ev","str","^CleanBedroom","/str",{"x()":"ShowBackground","exArgs":1},"out","/ev","\n","ev","str","ev",{"VAR?":"name"},"out","/ev","^'s Room, Sunday","/str",{"f()":"setTitle"},"pop","/ev","\n","^You take the time to clean your room, clearing away the clutter of gadgets and technology that had been weighing you down. In doing so, you made a conscious decision to go on a digital cleanse — a temporary break from technology to focus on healthier habits and self-care.","\n","^As you disconnect from the digital world, you rediscover the joys of living in the moment — whether it's taking a walk through nature, picking up a hobby, or enjoying the company of loved ones.","\n","^You realize the importance of taking time for yourself — to rest,  recharge, and reconnect with truly matters. As you commit to prioritizing your well-being and nurturing healthy habits, you feel a sense of purpose and fulfillment growing within you.","\n","^With a contented sigh, you close your eyes and drift off to sleep, filled with hope for the future and a deep sense of appreciation for the journey you're on. Tomorrow is a new day, and though there may still be obstacles to overcome, you face them with resilience, knowing that you're moving in the right direction.","\n","ev","str","^End Game","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n","ev",{"x()":"RestartGame"},"out","/ev","\n","end",{"#f":5}]}],{"#f":1}],"BadEnding":[["ev","str","^Desolate","/str",{"x()":"PlayBGM","exArgs":1},"out","/ev","\n","^The next day, you wake up with a heavy heart, still feeling the weight of your decision from the previous night. As you move through your morning routine, a sense of hopelessness settles over you. Throughout the day, you find yourself succumbing to comfort and retreating further into yourself.","\n","^The days turn into weeks and weeks into months, you find yourself sinking deeper into unhealthy habits consumed by depression and loneliness.","\n","^In the end, you realize that by refusing to strive toward healthier habits and making a change, you’ve sealed your own fate, condemning yourself to a life of loneliness and despair. As you stare off, you can’t help but wonder what might have been if only you had the strength to step outside your comfort zone. But now, it’s too late.","\n","ev","str","^End Game","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n","ev",{"x()":"RestartGame"},"out","/ev","\n","end",{"#f":5}]}],{"#f":1}],"updateHappiness":[{"temp=":"amount"},"ev",{"VAR?":"happiness"},{"VAR?":"amount"},"+","/ev",{"VAR=":"happiness","re":true},{"#f":1}],"setTitle":[{"temp=":"string"},"ev",{"VAR?":"string"},"/ev",{"VAR=":"title","re":true},{"#f":1}],"global decl":["ev","str","^","/str",{"VAR=":"name"},0,{"VAR=":"happiness"},"str","^","/str",{"VAR=":"title"},"/ev","end",null],"#f":1}],"listDefs":{}}